{
    "landingPage": {
        "content": {
            "markdown-desc": "# Prueba de programación para el puesto de Full-Stack en Planet Dataset\n\n_Los detalles de la pruebas los puedes encontrar [en el repositorio de Github](https://github.com/Planet-Dataset/fullstack-assignment)._\n## ¿Qué es esta aplicación?\nEsta aplicación de Angular es una estructura básica que te proporcionamos para que puedas implementar\nla tercera y cuarta tarea de la prueba:\n- Implementar una vista para lista y editar los cambios de moneda seguidos.\n- Implementar una vista para mostrar los precios actuales para dichos cambios.\n\nPara facilitarte la implementación hemos montado este proyecto, donde tienes un módulo listo para\nhacer estas vistas.\n\nLa estructura del proyecto la puedes encontrar en su README específico, en `/services/front-end/README.md`. [Ver README](https://github.com/Planet-Dataset/fullstack-assignment/tree/feature/front-end-service/services/front-end#readme)\n## Recomendaciones generales\n1. El contenido de esta landing page está en Markdown. Este, y el README específico de front (en `/services/front-end/README.md`)\nson buenos sitios donde dejar comentarios del funcionamiento de la aplicación web.\n2. NgRX está instalado y configurado, incluída la librería para usar las herramientas de desarrollo. Puedes usarlo para gestionar\nel estado de la aplicación.\n3. No es obligatorio traducir los textos, pero está todo montado para que puedas hacerlo fácilmente y quede una aplicación más\npresentable.\n4. Un buen sitio para empezar es la lista de monedas seguidas y los controles para añadir y quitar, dado que la funcionalidad de back-end ya te la proporcionamos nosotros.\n5. Importante, valoramos tu tiempo. Si algo te está llevando demasiado tiempo probablemente no sea lo que te pedimos. Buscamos\nla implementación de dos vistas que muestran listas de datos, y controles para añadir y quitar a través de los endppoints.\nValoraremos la calidad de la solución; no es necesario que amplíes la funcionalidad.\n\nBuena suerte y a por ello!"
        }
    }
}